# if   条件1:
# 	条件成立执行的代码1
# 	条件成立执行的代码2
# 	......
# elif  条件2:
# 	条件2成立执行的代码1
# 	条件2成立执行的代码2
# 	......
# else:
# 	以上条件都不成立执行的代码
# 需求：根据用户输入的年龄去判断用户所属的年龄区间
"""
1. input输入用户的年龄
2. 用If语句判断年龄（多重判断---->elif）
3. 根据不同的判断结果执行不同的操作---》f"{变量}"
"""
# age = int(input("请您输入您的年龄："))
# if age < 18:
#     print(f"您的年龄是{age}, 为童工！")
# elif 18 <= age <= 60:                               # 注意1：elif后面需要接条件的
#     print(f"您的年龄是{age}, 为合法工作年龄！")
# else:                                               # 注意2：else是最后一种情况，后面不接条件
#     print(f"您的年龄是{age}, 为退休年龄！")









