# 列表，是一种数据类型，专门用来存储多个数据，也可以叫做序列
# 思考：班上100个同学怎么样存储名字？
# 答：用列表的格式存储
# “列表的格式”: [数据1,数据2,数据3,数据4......]

# 列表的循环遍历取值
# list1 = ["maiya", "tom", "Lisa"]
# 按下标：序列名[下标]
# print(list1[1])         # tom
# for i in list1:
#     print(i)

# 列表嵌套:  指的是一个列表里面包含了其他的子列表
# namelist = [["小明", "小红", "小绿"], ["TOM", "Lily", "Rose"], ["张三", "李四", "王五"]]
# print(namelist[0])          # ['小明', '小红', '小绿']
# print(namelist[0][2])       # 小绿
# 按下标：序列名[下标]

# 1. 导入模块:import 模块名
# import random
# 2. 使用模块中的函数,模块名.函数名()
# randint():随机生成开始到结束的数字，前包后也包
# num = random.randint(0, 2)   、       # 随机生成0-2的数字

# 需求：8个老师，3个办公室，将8个老师随机分配到三个办公室中,
# teachers = ["a", "b", "c", "d", "e", "f", "g", "h"]
# offices = [[], [], []]        # 一个[]代表一个办公室
# # 获取每个老师的名字---》for循环遍历取值
# # 把老师名字添加到办公室---》列表名.append(数据)
# for i in teachers:                  # i就是老师的名字
#     num = random.randint(0, 2)
#     # 使用randint函数让下标随机生成，就可以随机分配老师
#     offices[num].append(i)            # 把每次循环拿到的老师名字添加到随机的这个办公室中
# print(offices)












