# 本次为第三周作业，需要发送以正文方式至简单老师邮箱进行检查
# # 1、将字符串 s = "alex"转换为元组，然后检测数据类型打印输出
# s = "alex"
# s = set(s)
# print(type(s))
# # 2、 元素分类 有如下值列表[11,22,33,44,55,66,77,88,99,90]
# # 将所有小于 66 的值保存至字典的第一个 key 中，将大于 66 值保存至第二个key 的值中。实现效果：
# # {"k1": [11, 22, 33, 44, 55], "k2": [77, 88, 99, 90]}
# list1 = [11, 22, 33, 44, 55, 66, 77, 88, 99, 90]
# dict1 = {'K1': [], 'K2': []}
# for i in list1:
#     if i < 66:
#         dict1['K1'].append(i)
#     elif i > 66:
#         dict1['K2'].append(i)
#     else:
#         continue
# print(dict1)
# # 3、（选做题）列表倒数。使用字符串的切片，逆序输出元素 原列表 a=[123,4567,12,3456]，实现效果 a=[321,7654,21,6543]。
# a = [123, 4567, 12, 3456]
# j = 0
# while j < len(a):
#     a[j] = int(str(a[j])[::-1])
#     j += 1
# print(a)






