# 1. a=60;b=13;c=13，a>b and b<c 输出的结果是(False）

# 2. 已知x=3，并且 id(x)的返回值为496103280，那么执行语句x+=6之后，判断表达式id(x)== 496103280的值为（False）

# 3. 己知x=3，那么执行语句x *= 6之后，x的值为（18）

# 4. break语句用在循环语句中，是否可以跳出二重循环结构(否)

# 5. 对于带有else子句的 for循环和 while循环，当循环因循环条件不成立.而自然结束时(会?不会?)执行else 中的代码。(会)

# 6. 假设列表对象aList的值为[3，4，5，6, 7，9，11，13，15，17]，那么切片aList[3 : 7]得到的值是([6，7，9，11])

# 7. 任意长度的Python列表、元组和字符串中最后一个元素的下标为（-1）

# 8. Python语句 list1(range(1,10,3))执行结果为（[1, 4, 7]）,那么list2(range(6))[::2]执行结果为([0, 2, 4])

# 9. 已知x = {1 :2}，那么在执行语句x[2] = 3 之后，x的值为({1:2, 2:3})

# 10. 表达式set([1，1, 2, 3])的值为({1, 2, 3})

# 11. 如果函数中没有return语句或者return语句不带任何返回值，那么该函数的返回值为（空）

# 12. 表达式sum(range(1, 10, 2))的值为(25)

# 13．编写一个程序，判定用户输入的两个数a和 b，如果用户输入的第一个数大，则两数互换，如果相等或第一个数小，那原样输出。
# num1 = int(input("请输入第一个数字："))
# num2 = int(input("请输入第二个数字："))
# if num1 > num2:
#     num3 = num2
#     num2 = num1
#     num1 = num3
#     print(num1)
#     print(num2)
# else:
#     print(num1)
#     print(num2)
