"""
语法：
while 条件:
    重复执行的内容
"""
# print("汤姆跑圈")
# print("汤姆跑圈")
# print("汤姆跑圈")
# print("汤姆跑圈")
# 所谓的条件就是用来去控制循环内容循环的次数
# a = 1               # 定义变量，为了循环的条件
# while a <= 4:       # 因为a = 1,所以条件始终成立
#     print("汤姆跑圈")
#     a += 1          # 计数器，让a每次累加1，等价于 a = a + 1

# while循环的组成部分：1. 定义变量， 2.循环的条件， 3. 计数器
# a. 计算1-100的累加和--->循环内容是什么?---》重复执行做加法运算---》上一次运算的结果+下一个数字
# i = 1               # 控制循环内容循环的次数
# b = 0                # 为了保存每次加法运算之后的结果
# while i <= 100:
#     # 循环内容：加法运算---》上一次运算的结果+下一个数字
#     b = b + i
#     i += 1          # 计数器必须要缩进，缩进就是参与循环，顶格不参与循环
# print(b)
















