# 选择题
# 1. 关于函数，说法错误的是：(  )
# A. 使用函数的目的是为了在程序中减少代码量
# B. 函数的参数是使用了函数外部的数据，函数的返回值是为了把函数内部的数据返回出去
# C. 函数的返回值中，return可以退出函数
# D. 在函数中，print和return的使用是没有任何区别

# 2. 以下描述错误的是(   )
# A. 函数不能被单独当做模块进行导入
# B. 一个.py结尾的可以当做模块进行导入
# C. 函数的使用本质上是封装了代码，在需要的时候调用而已
# D. return可以负责函数的返回值，也可以用来退出函数

# 3. 关于Python的全局变量和局部变量，以下选项中描述错误的是：( )
# A. 全局变量可以在多个函数中使用
# B. 全局变量的名字不能与局部变量的名字相同
# C. 为了区分全局变量和局部变量，往往起不同的名字
# D. 局部变量的值可以通过return返回给调用者

# 4.下列说法错误的是：(  )
# A. 在模块和包中，包里面包括模块，模块里面包括类，函数，变量等
# B. 在异常中，Exception可以作为万能类捕获异常使用
# C. 在异常中，抛出异常就可以让控制台不报错
# D. 在异常中，raise的下方是不接任何代码的









